; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l10-c6)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 
          c0 c1 c2 c3 c4 c5 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(location l5)
(location l6)
(location l7)
(location l8)
(location l9)
(car c0)
(car c1)
(car c2)
(car c3)
(car c4)
(car c5)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l0 l5)
(not-eq l5 l0)
(not-eq l0 l6)
(not-eq l6 l0)
(not-eq l0 l7)
(not-eq l7 l0)
(not-eq l0 l8)
(not-eq l8 l0)
(not-eq l0 l9)
(not-eq l9 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l1 l5)
(not-eq l5 l1)
(not-eq l1 l6)
(not-eq l6 l1)
(not-eq l1 l7)
(not-eq l7 l1)
(not-eq l1 l8)
(not-eq l8 l1)
(not-eq l1 l9)
(not-eq l9 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l2 l5)
(not-eq l5 l2)
(not-eq l2 l6)
(not-eq l6 l2)
(not-eq l2 l7)
(not-eq l7 l2)
(not-eq l2 l8)
(not-eq l8 l2)
(not-eq l2 l9)
(not-eq l9 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(not-eq l3 l5)
(not-eq l5 l3)
(not-eq l3 l6)
(not-eq l6 l3)
(not-eq l3 l7)
(not-eq l7 l3)
(not-eq l3 l8)
(not-eq l8 l3)
(not-eq l3 l9)
(not-eq l9 l3)
(not-eq l4 l5)
(not-eq l5 l4)
(not-eq l4 l6)
(not-eq l6 l4)
(not-eq l4 l7)
(not-eq l7 l4)
(not-eq l4 l8)
(not-eq l8 l4)
(not-eq l4 l9)
(not-eq l9 l4)
(not-eq l5 l6)
(not-eq l6 l5)
(not-eq l5 l7)
(not-eq l7 l5)
(not-eq l5 l8)
(not-eq l8 l5)
(not-eq l5 l9)
(not-eq l9 l5)
(not-eq l6 l7)
(not-eq l7 l6)
(not-eq l6 l8)
(not-eq l8 l6)
(not-eq l6 l9)
(not-eq l9 l6)
(not-eq l7 l8)
(not-eq l8 l7)
(not-eq l7 l9)
(not-eq l9 l7)
(not-eq l8 l9)
(not-eq l9 l8)
(empty-ferry)
(at c0 l8)
(at c1 l5)
(at c2 l4)
(at c3 l3)
(at c4 l0)
(at c5 l8)
(at-ferry l8)
)
(:goal
(and
(at c0 l0)
(at c1 l7)
(at c2 l0)
(at c3 l4)
(at c4 l5)
(at c5 l7)
)
)
)

; plan
1. (board c0 l8)
   deleted: (at c0 l8) (empty-ferry)
   added: (on c0)
   goals met: 0 of 6
2. (sail l8 l0)
   deleted: (at-ferry l8)
   added: (at-ferry l0)
   goals met: 0 of 6
3. (debark c0 l0)
   deleted: (on c0)
   added: (at c0 l0) (empty-ferry)
   goals met: 1 of 6
4. (board c4 l0)
   deleted: (at c4 l0) (empty-ferry)
   added: (on c4)
   goals met: 1 of 6
5. (sail l0 l5)
   deleted: (at-ferry l0)
   added: (at-ferry l5)
   goals met: 1 of 6
6. (debark c4 l5)
   deleted: (on c4)
   added: (at c4 l5) (empty-ferry)
   goals met: 2 of 6
7. (board c1 l5)
   deleted: (at c1 l5) (empty-ferry)
   added: (on c1)
   goals met: 2 of 6
8. (sail l5 l7)
   deleted: (at-ferry l5)
   added: (at-ferry l7)
   goals met: 2 of 6
9. (debark c1 l7)
   deleted: (on c1)
   added: (at c1 l7) (empty-ferry)
   goals met: 3 of 6
10. (sail l7 l4)
   deleted: (at-ferry l7)
   added: (at-ferry l4)
   goals met: 3 of 6
11. (board c2 l4)
   deleted: (at c2 l4) (empty-ferry)
   added: (on c2)
   goals met: 3 of 6
12. (sail l4 l0)
   deleted: (at-ferry l4)
   added: (at-ferry l0)
   goals met: 3 of 6
13. (debark c2 l0)
   deleted: (on c2)
   added: (at c2 l0) (empty-ferry)
   goals met: 4 of 6
14. (sail l0 l7)
   deleted: (at-ferry l0)
   added: (at-ferry l7)
   goals met: 4 of 6
15. (sail l7 l3)
   deleted: (at-ferry l7)
   added: (at-ferry l3)
   goals met: 4 of 6
16. (board c3 l3)
   deleted: (at c3 l3) (empty-ferry)
   added: (on c3)
   goals met: 4 of 6
17. (sail l3 l7)
   deleted: (at-ferry l3)
   added: (at-ferry l7)
   goals met: 4 of 6
18. (sail l7 l4)
   deleted: (at-ferry l7)
   added: (at-ferry l4)
   goals met: 4 of 6
19. (debark c3 l4)
   deleted: (on c3)
   added: (at c3 l4) (empty-ferry)
   goals met: 5 of 6
20. (sail l4 l7)
   deleted: (at-ferry l4)
   added: (at-ferry l7)
   goals met: 5 of 6
21. (sail l7 l8)
   deleted: (at-ferry l7)
   added: (at-ferry l8)
   goals met: 5 of 6
22. (board c5 l8)
   deleted: (at c5 l8) (empty-ferry)
   added: (on c5)
   goals met: 5 of 6
23. (sail l8 l7)
   deleted: (at-ferry l8)
   added: (at-ferry l7)
   goals met: 5 of 6
24. (debark c5 l7)
   deleted: (on c5)
   added: (at c5 l7) (empty-ferry)
   goals met: 6 of 6
